In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("F:/Datasets/titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

## Data Exploration

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [4]:
target = df.Survived
inputs = df.drop('Survived',axis='columns')

## One Hot Encoding

In [5]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [6]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [7]:
inputs.drop('Sex',axis=1,inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

## Drop NaN Values

In [8]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [9]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [10]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(10)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1
6       1  54.000000  51.8625       0     1
7       3   2.000000  21.0750       0     1
8       3  27.000000  11.1333       1     0
9       2  14.000000  30.0708       1     0

## Split the Dataset

In [11]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2,random_state=10)

In [12]:
len(X_train)

712

In [13]:
len(X_test)

179

In [14]:
len(inputs)

891

In [15]:
X_train.head()

     Pclass        Age     Fare  female  male
57        3  28.500000   7.2292       0     1
717       2  27.000000  10.5000       1     0
431       3  29.699118  16.1000       1     0
633       1  29.699118   0.0000       0     1
163       3  17.000000   8.6625       0     1

## Gaussian Naive Bayes

In [16]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [17]:
model.fit(X_train,y_train)

GaussianNB()

In [18]:
model.score(X_test,y_test) * 100

82.68156424581005

In [19]:
X_test.head(10)

     Pclass   Age      Fare  female  male
590       3  35.0    7.1250       0     1
131       3  20.0    7.0500       0     1
628       3  26.0    7.8958       0     1
195       1  58.0  146.5208       1     0
230       1  35.0   83.4750       1     0
646       3  19.0    7.8958       0     1
75        3  25.0    7.6500       0     1
586       2  47.0   15.0000       0     1
569       3  32.0    7.8542       0     1
287       3  22.0    7.8958       0     1

In [20]:
y_test.head(8)

590    0
131    0
628    0
195    1
230    1
646    0
75     0
586    0
Name: Survived, dtype: int64

In [22]:
model.predict(X_test[:10])

array([0, 0, 0, 1, 1, 0, 0, 0, 0, 0], dtype=int64)

In [23]:
model.predict_proba(X_test[:10])

array([[9.88386356e-01, 1.16136435e-02],
       [9.86517813e-01, 1.34821869e-02],
       [9.87819352e-01, 1.21806477e-02],
       [1.69366845e-05, 9.99983063e-01],
       [2.50380494e-03, 9.97496195e-01],
       [9.86311511e-01, 1.36884891e-02],
       [9.87645433e-01, 1.23545669e-02],
       [9.73960508e-01, 2.60394920e-02],
       [9.88379286e-01, 1.16207142e-02],
       [9.87084311e-01, 1.29156895e-02]])